<?php 

/*
		练习1
		打印1~100之间7的倍数
		打印1~100之间个位为7的数
		打印1~100之间十位为7的数
		打印1~100之间个位不为7,十位不为7,以及不是7的倍数

		练习2
		打印九九乘法表

	*/

	//1.1
	for($i = 1;$i <= 100;$i++){
		if($i % 7 == 0){
			echo $i." ";
		}
	}
	echo "<br>";
	//1.2
	for($i = 1;$i <= 100;$i++){
		if($i % 10 == 7){
			echo $i." ";
		}
	}
	echo "<br>";
	//1.3
	for($i = 1;$i <= 100;$i++){
		if(floor($i/10) == 7){
			echo $i." ";
		}
	}
	echo "<br>";
	//1.4
	for($i = 1;$i <= 100;$i++){
		if(($i % 7 != 0)AND($i % 10 != 7)AND(floor($i/10) != 7)){
			echo $i." ";
		}
	}
	echo "<br>";
	//2
	
	for($i = 0;$i < 10;$i++){
		for($j = 1;$j <= $i;$j++){
			echo $i."*".$j."=".($i*$j)." ";
		}
		echo "<br>";
	}




 ?>

